-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Jan 17, 2020 at 02:49 AM
-- Server version: 5.7.17-log
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `revel-market_db`
--

-- --------------------------------------------------------

--
-- Table structure for table `tb_news`
--

CREATE TABLE `tb_news` (
  `news_code` varchar(13) NOT NULL,
  `news_title` text NOT NULL,
  `news_date` varchar(50) NOT NULL,
  `news_description` text NOT NULL,
  `news_detail` text NOT NULL,
  `news_show` int(1) NOT NULL,
  `news_image_name` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_news`
--

INSERT INTO `tb_news` (`news_code`, `news_title`, `news_date`, `news_description`, `news_detail`, `news_show`, `news_image_name`) VALUES
('N0001', 'เปิดวาร์ปความน่ารัก \"นิกี้\" เมมเบอร์น้องเล็กสุดของวง \"BNK48\"', '2019-10-14', 'นอกจากความสามารถในการร้องและเต้นแล้ว จุดเด่นของสมาชิก BNK48 ก็การที่เมมเบอร์แต่ละคนจะมีคาแรคเตอร์เฉพาะตัว จนทำให้ทุกๆ คนต่างมีแฟนคลับของตัวเอง ซึ่งหนึ่งในสมาชิกที่น่าจับตาและมีเอกลักษณ์เฉพาะตัวก็คือ นิกี้-วรินท์รัตน์ ยลประสงค์ ', 'สำหรับ นิกี้ วรินท์รัตน์ นั้นเป็นสมาชิก BNK48 ที่เข้ามาอยู่ในรุ่นที่ 2 ซึ่งนอกจากการเป็นเมมเบอร์ลูกครึ่งที่มีเชื้อสาย เนเธอร์แลนด์ และ ไทย แล้ว การที่นิกี้มีอายุเพียงแค่ 14 ปี ก็สร้างความประหลาดใจให้กับหลายๆ คนด้วย โดยในปัจจุบันเธอได้เป็นสมาชิกที่มีอายุน้อยที่สุดของวง ถึงแม้ว่าจะเป็นเมมเบอร์ที่มีอายุน้อย แต่ความสามารถของนิกี้ก็ไม่ธรรมดา เพราะเธอเป็นหนึ่งในสมาชิกรุ่น 2 ที่สามารถติดเซ็มบัตสึเพลง \"ฤดูใหม่ Tsugi no Season\" หลังเปิดตัวในฐานะสมาชิกเพียงไม่กี่เดือน และยังสามารถออดิชันเป็น 1 ในเซ็มบัตสึเพลง \"คิดถึง...\" (Mata Anata no Koto wo Kangaeteta) ซึ่งสมาชิกที่จะร่วมถ่ายทอดผลงานนี้ ต้องผ่านการทดสอบความสามารถในการร้องเพลง ', 1, 'news/72481570_673796786447388_613773491140820992_o.jpg'),
('N0002', 'เบื้องหลังน่ารัก เฌอปราง-ปัญ-ฟ้อนด์-น้ำใส-มิวนิค BNK48', '2019-12-19 16:35:02', 'เดินทางมาถึงตอนที่ 4 แล้ว สำหรับซีรีส์แนวโรแมนติกแฟมิลี่ \"ONE YEAR 365 วัน บ้านฉัน บ้านเธอ\" ที่ได้ 8 สาวจากวงไอดอลเกิร์ลกรุ๊ปชื่อดัง BNK48 มาร่วมแสดงด้วย นำทีมโดย เฌอปราง อารีย์กุล, ปัญ ปัญสิกรณ์ ติยะกร, เจน กุลจิราณัฐ อินทรศิลป์, นํ้าใส พิชญาภา นาถา, จูเน่ เพลินพิชญา โกมลารชุน, วี วีรยา จาง, มิวนิค นันท์นภัส เลิศนามเชิดสกุล และ ฟ้อนด์ ณัฐทิชา จันทรวารีเลขา ร่วมด้วยนักแสดงมากฝีมืออย่าง พี่แหม่ม คัทลียา, พี่ดู๋ สัญญา, เก้า จิรายุ และ ไอซ์ซึ ณัฐรัตน์ จากฝีมือกำกับการแสดง แคลร์ จิรัศยา วงษ์สุทิน', 'ล่าสุด 5 สาว BNK48 นำทีมโดย เฌอปราง, ปัญ, น้ำใส, ฟ้อนด์ และ มิวนิค พร้อมด้วยพี่แคลร์ ผู้กำกับ ได้เดินทางมาเยี่ยมเยียนถึง บันเทิงไทยรัฐออนไลน์ ซึ่งแต่ละคนนั้นบอกได้คำเดียวว่า พลังเหลือล้นเป็นที่สุด แม้ว่าในวันนั้นจะเดินสายเยี่ยมสื่อมวลชนกันตั้งแต่เช้า แต่สาวๆ ยังร่าเริงสดใสได้ตลอดเวลา งานนี้เลยชวนสาวๆ BNK48 เล่นเกม \"จิ้มโป่งแตก\" โดยต้องจิ้มลูกโป่งให้แตก พร้อมกับตอบคำถามที่ซ่อนอยู่ในนั้น ', 1, 'news/Dtbezn3nNUxytg04OanBwUEv7i1VLkQe3JopgU6nWRMW6u.webp'),
('N0003', 'เป็นสาวแว่นผิดตรงไหน! เผย 4 อาชีพที่ไม่ได้รับอนุญาตให้สวมแว่นตาขณะทำงาน จากรายการทีวีญี่ปุ่น', '2019-11-15', 'รายการทีวีญี่ปุ่นเผยข้อมูลพร้อมเหตุผล อาชีพที่ถูกห้ามไม่ให้สวมแว่นตาขณะปฏิบัติงาน พร้อมเหตุผล', 'ก่อนหน้านี้ได้มีประเด็นที่เป็นที่ฮือฮาบนโลกโซเชียลญี่ปุ่น กับเหตุการณ์ที่พนักงานหญิงของร้านอาหารแห่งหนึ่งถูกห้ามไม่ให้สวมแว่นตาขณะสวมกิโมโนซึ่งเป็นเครื่องแบบของพนักงานเสิร์ฟในร้านนี้ ด้วยเหตุผลที่ว่าแว่นตาซึ่งเป็นของสมัยใหม่ไม่เข้ากับชุดกิโมโนที่เป็นเครื่องแต่งกายแบบดั้งเดิม ทำลายบรรยากาศย้อนยุคสูงส่งที่ทางร้านตั้งไว้\r\n\r\nแต่ดูเหมือนว่าไม่ใช่แค่เพียงร้านอาหารที่ต้องการรักษาบรรยากาศแบบดั้งเดิมอย่างร้านนี้เท่านั้น ที่ไม่อนุญาตให้พนักงานสวมแว่นตาขณะทำงาน โดยทางราย Sukkiri ของสถานี Nippon TV ได้นำประเด็นนี้ขึ้นมาพูดในรายการด้วยการตั้งคำถามว่า “คุณรู้สึกอย่างไร เมื่อผู้หญิงถูกห้ามไม่ให้ใส่แว่นตา” พร้อมกับเผยข้อมูลว่ายังมีอีก 3 อาชีพ ที่มีข้อบังคับคล้าย ๆ กัน', 1, 'news/list-of-jobs-in-japan-that-dont-allow-women-to-wear-glasses-upsets-fans-of-vision-meganekko.jpg'),
('N0004', 'OG ทุบ Liquid ป้องแชมป์ DOTA ศึก TI – แข่ง 2 ปี ฟันเงินทะลุ 800 ล้าน', '2019-12-16 16:35:02', 'การแข่งขันอีสปอร์ต เกม DOTA 2 รายการ The Internation 2019 ที่เมืองเซี่ยงไฮ้ ประเทศจีน เมื่อวันที่ 25 ส.ค. เป็นการแข่งขันรอบชิงชนะเลิศ ระหว่าง OG แชมป์เก่าจากครั้งที่แล้ว พบกับ TEAM Liquid ดีกรีแชมป์ เมื่อปี 2017 ที่ไต่ขึ้นมาจากสายล่าง โดยแข่งขันกันในระบบ 3 ใน 5 เกม', 'สำหรับการแข่งขันรายการ TI9 ถือเป็นการแข่งขันอีสปอร์ตที่มีเงินรางวัลรวมสูงที่สุดถึง 34.29 ล้านเหรียญสหรัฐ หรือ ประมาณ 1,055 ล้านบาท\n\nซึ่งผลการแข่งขันในคู่นี้เกมแรกLiquid เปิดฉากได้สวยกว่า ออกนำไปก่อน 1-0 เกม แต่หลังจากนั้นกลายเป็นทีมแชมป์เก่าOG ที่งัดฟอร์มเก่งของตัวเองกลับมาและเอาชนะ 3 เกมรวด ทำให้พวกเขาสอยแชมป์ไปครองด้วยสกอร์ 3-1 เกม\n\nส่งผลให้OG ได้รับเงินรางวัลในตำแหน่งแชมป์ไปถึง 15.6 ล้านเหรียญสหรัฐ หรือราว 480 ล้านบาท และหากนับรวมเงินรางวัลจากแชมป์สมัยที่ อีก 11.2 ล้านเหรีญ จะทำให้พวกเขากวาดเงินก้อนโตจากการแข่งขันแค่ 2 ปี ถึงราว 825 ล้านบาทเลยทีเดียว\n\nทางด้านทีมLiquid รองแชมป์หนนี้รับได้ 4.458 ล้านเหรียญ หรือราว 137 ล้านบาท\n\nขณะที่การแข่งขันในปีหน้า หรือ The International 2020 จะไปแข่งกันที่ประเทศสวีเดน', 0, 'news/f857a736-4cf3-4f3c-9acf-0671a790ef7f.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `tb_shop`
--

CREATE TABLE `tb_shop` (
  `shop_code` varchar(13) NOT NULL,
  `shop_name` text NOT NULL,
  `shop_address` text,
  `shop_tel` varchar(50) DEFAULT NULL,
  `shop_description` varchar(200) NOT NULL,
  `shop_detail` text,
  `shop_latitude` varchar(50) NOT NULL,
  `shop_longitude` varchar(50) NOT NULL,
  `shop_image_name` varchar(250) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_shop`
--

INSERT INTO `tb_shop` (`shop_code`, `shop_name`, `shop_address`, `shop_tel`, `shop_description`, `shop_detail`, `shop_latitude`, `shop_longitude`, `shop_image_name`) VALUES
('S0001', '7-ELEVEN เพื่อนที่รู้ใจ... ใกล้ๆ คุณ', 'ตำบลในเมือง อำเภอเมืองนครราชสีมา นครราชสีมา 30000', '022-770-130', 'ช็อปปิ้งออนไลน์แห่งใหม่ ครบทุกความต้องการ ช็อปเลย! ลดกระหน่ำ', 'พบสินค้าและโปรโมชั่นจากเซเว่น อีเลฟเว่น พร้อมข่าวสารและกิจกรรมมากมาย อัพเดตก่อนใครทุกเดือน! www.7eleven.co.th.', '14.994983675357448', '102.08315245356425', 'shop/070bd9cbc7ae8371127d8d514a037103.jpeg'),
('S0002', 'Shabu monster', 'Manasin Rd., Nimuang, Muang', '096 707 0130', 'ร้านเปิดทุกวัน 12.00-22.00น. (ครัวปิด 21.30น.)\r\n', 'ม่อนภูมิใจนำเหนอบุฟเฟต์ สุกี้-ชาบูญี่ปุ่น จัดเต็ม!! หมู เนื้อ กุ้ง ปลาดอลลี่ ปลาหมึก ผักสดหลากหลายชนิด ของกินเล่น ไอติม ใครไม่มากินนับว่าใจแข็งมากๆ ท่านละ 329 บาท net อย่ารอช้า tag เพื่อนหรือแฟนให้พามากินด่วนน', '', '', 'shop/2018100408eb5b486290f70b7994692311c504f8093844.jpg'),
('S0003', 'Class Cafe', 'ถนนสุรนารายณ์ นครราชสีมา (เลยไนท์บ้านเกาะไปนิดหน่อย ฝั่งซ้ายมือ)', '', 'เมนูเด็ด: ชาส้มเจจู, ลาเต้เย็น', 'Class Cafe ร้านกาแฟสาขาเยอะมากแห่งเมืองโคราช เปิดสาขาล่าสุดในโซนบ้านเกาะเสียทีครับ พิกัดอยู่ตรงตลาดโซลาร์มาร์เกตเก่า เลยไนท์บ้านเกาะมาเล็กน้อย สาขานี้เปิด 24 ชั่วโมงเช่นเดียวกัน ธีมร้านมาแบบสีขาวสว่าง ดู contrast กับสาขาวัดบูรพ์ เมนูที่สั่งก็ตามมาตรฐานคลาสนะครับ เอาเป็นว่าชี้เป้าพิกัดใหม่ สำหรับกินกาแฟ อ่านหนังสือ พูดคุย ทำงาน กันแบบ all-day-all-night กันครับ', '', '', 'shop/14992474601499247534l.jpg');

-- --------------------------------------------------------

--
-- Table structure for table `tb_user`
--

CREATE TABLE `tb_user` (
  `user_code` varchar(13) NOT NULL,
  `user_username` varchar(50) NOT NULL,
  `user_password` varchar(200) NOT NULL,
  `user_name` varchar(200) NOT NULL,
  `user_lastname` varchar(200) NOT NULL,
  `user_address` text,
  `user_tel` varchar(50) DEFAULT NULL,
  `user_email` varchar(200) DEFAULT NULL,
  `user_image` text
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `tb_user`
--

INSERT INTO `tb_user` (`user_code`, `user_username`, `user_password`, `user_name`, `user_lastname`, `user_address`, `user_tel`, `user_email`, `user_image`) VALUES
('U0001', 'admin', '123456', 'Revel', 'Developer', 'ตำบลในเมือง อำเภอเมืองนครราชสีมา นครราชสีมา 30000', '0987877899', 'support@revevlsoft.co.th', 'user/5f89a410-7d9e-455f-a56e-00e627792e7c.jpg');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `tb_news`
--
ALTER TABLE `tb_news`
  ADD PRIMARY KEY (`news_code`);

--
-- Indexes for table `tb_shop`
--
ALTER TABLE `tb_shop`
  ADD PRIMARY KEY (`shop_code`);

--
-- Indexes for table `tb_user`
--
ALTER TABLE `tb_user`
  ADD PRIMARY KEY (`user_code`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
